Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: lispref/back.texi:30 lispref/intro.texi:25 Because Emacs Lisp is designed for use in an editor, it has special features for scanning and parsing text as well as features for handling files, buffers, displays, subprocesses, and so on. Emacs Lisp is closely integrated with the editing facilities; thus, editing commands are functions that can also conveniently be called from Lisp programs, and parameters for customization are ordinary Lisp variables.
fr_fr: Puisque Emacs Lisp est conçu pour l'utilisation dans un éditeur, il a des usages spéciaux pour le balayage et l'analyse de texte aussi bien que des dispositifs pour manipuler des fichiers, tampons, affichages, sous-processus, et ainsi de suite. L'Emacs Lisp est intégré avec beaucoup des facilités d'édition ; ainsi, les commandes d'édition sont des fonctions qui peuvent commodément appeler également des programmes de Lisp, et les paramètres pour la personnalisation sont des variables ordinaires de Lisp.

source: lispref/doclicense.texi:10 Copyright (C) 2000,2001,2002 Free Software Foundation, Inc. 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA
fr_fr: Copyright (C) 2000,2001,2002 Free Software Foundation, Inc. 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA

source: lispref/elisp.texi:104 This Info file contains edition @value{VERSION} of the GNU Emacs Lisp Reference Manual, corresponding to GNU Emacs version @value{EMACSVER}.
fr_fr: Ce dossier d'information contient l'édition @value{VERSION} du Manuel de référence GNU Emacs Lisp, correspondant à la version @value{EMACSVER} de GNU Emacs.

source: lispref/elisp.texi:1170 Abbrevs And Abbrev Expansion
fr_fr: Abréviations et abréviations expansions

source: lispref/elisp.texi:1177 * Abbrev Mode:: Setting up Emacs for abbreviation. * Abbrev Tables:: Creating and working with abbrev tables. * Defining Abbrevs:: Specifying abbreviations and their expansions. * Abbrev Files:: Saving abbrevs in files. * Abbrev Expansion:: Controlling expansion; expansion subroutines. * Standard Abbrev Tables:: Abbrev tables used by various major modes.
fr_fr: * Mode abbrev:: Configuration d'Emacs pour l'abréviation. * Tables d'abréviations:: Créer et travailler avec des tables d'abréviations. * Définir des abréviations:: Spécifier des abréviations et leurs expansions. * Fichiers d'abréviations:: Sauver des abréviations dans les fichiers. * Expansions d'abréviations:: Contrôler l'expansion ; sous-programmes d'expansions. * Tables standard d'abréviations:: Tables d'abréviations employées par divers modes majeurs.

source: lispref/elisp.texi:195 Introduction
fr_fr: Introduction

source: lispref/elisp.texi:201 * Caveats:: Flaws and a request for help. * Lisp History:: Emacs Lisp is descended from Maclisp. * Conventions:: How the manual is formatted. * Version Info:: Which Emacs version is running? * Acknowledgements:: The authors, editors, and sponsors of this manual.
fr_fr: * Avertissements:: Erreurs et demande d'aide. * L'histoire de Lisp:: Emacs Lisp descend de Maclisp. * Conventions:: Comment le manuel est composé. * Information de version:: Quelle version d'Emacs fonctionne? * Remerciements:: Les auteurs, les rédacteurs, et les commanditaires de ce manuel.

source: lispref/elisp.texi:203 Conventions
fr_fr: Conventions

source: lispref/elisp.texi:211 * Some Terms:: Explanation of terms we use in this manual. * nil and t:: How the symbols @code{nil} and @code{t} are used. * Evaluation Notation:: The format we use for examples of evaluation. * Printing Notation:: The format we use for examples that print output. * Error Messages:: The format we use for examples of errors. * Buffer Text Notation:: The format we use for buffer contents in examples. * Format of Descriptions:: Notation for describing functions, variables, etc.
fr_fr: * Quelques termes:: Explication des termes que nous employons en ce manuel. * nil et t:: Comment les symboles @code{nil} et @code{t} sont employés. * Notation d'évaluation:: Le format que nous employons pour des exemples de l'évaluation. * Notation d'affichage:: Le format que nous employons quand les exemples affichent du texte. * Messages d'erreur:: Le format que nous employons pour des exemples d'erreurs. * Notation des textes de tampon:: Le format que nous employons pour le contenu de tampons dans les exemples. * Format des descriptions:: Notation pour décrire des fonctions, des variables, etc.

source: lispref/elisp.texi:213 Format of Descriptions
fr_fr: Format de descriptions

source: lispref/elisp.texi:218 * A Sample Function Description:: A description of an imaginary function, @code{foo}. * A Sample Variable Description:: A description of an imaginary variable, @code{electric-future-map}.
fr_fr: * Un exemple d'une description de fonction:: Une description d'une imaginaire fonction, @code{foo}. * Un exemple d'une description de variable:: Une description d'une imaginaire variable, @code{electric-future-map}.

source: lispref/elisp.texi:299 * Integer Basics:: Representation and range of integers. * Float Basics:: Representation and range of floating point. * Predicates on Numbers:: Testing for numbers. * Comparison of Numbers:: Equality and inequality predicates. * Numeric Conversions:: Converting float to integer and vice versa. * Arithmetic Operations:: How to add, subtract, multiply and divide. * Rounding Operations:: Explicitly rounding floating point numbers. * Bitwise Operations:: Logical and, or, not, shifting. * Math Functions:: Trig, exponential and logarithmic functions. * Random Numbers:: Obtaining random integers, predictable or not.
fr_fr: * Entiers basiques:: Représentation et champ des nombres entiers. * Nombres à virgule flottante basiques:: Représentation et champ des monbres à virgule flottante. * Attributs des nombres:: Tester les nombres. * Comparaison des nombres:: Attributs d'égalité et d'inégalité. * Conversions numériques:: Convertir des nombres à virgule flottante en nombres entiers et vice-versa. * Opérations arithmétiques:: Comment additionner, soustraire, multiplier et diviser. * Opérations d'arrondissage:: Arrondir explicitement les nombres à virgule flottante. * Opérations de bits:: and, or, not logique et décalage. * Fonctions mathématiques:: Fonctions trigonométrique, exponentielle et logarithmique. * Nombres aléatoires:: Obtention des nombres entiers aléatoires, prévisibles ou pas.

source: lispref/errors.texi:168 @code{"Symbol's value as variable is void"}@* @xref{Accessing Variables}.
fr_fr: @code{"La valeur du symbole comme variable est vide"}@* @xref{Accès aux variables}.

source: lispref/intro.texi:102 We let mail to this list accumulate unread until someone decides to apply the corrections. Months, and sometimes years, go by between updates. So please attach no significance to the lack of a reply---your mail @emph{will} be acted on in due time. If you want to contact the Emacs maintainers more quickly, send mail to @code{bug-gnu-emacs@@gnu.org}.
fr_fr: Nous laissons le courrier non lu de cette liste s'accumuler jusqu'à ce que quelqu'un décide d'appliquer les corrections. Les mois, et parfois les années, s'écoulent entre les mises à jour. Veuillez ne pas attacher de signification au manque d'une réponse---votre courrier @emph{devrait} être pris en compte en temps voulu. Si vous voulez contacter la maintenance d'Emacs plus rapidement, envoyer le courrier à @code{bug-gnu-emacs@@gnu.org}.

source: lispref/intro.texi:111 Lisp (LISt Processing language) was first developed in the late 1950s at the Massachusetts Institute of Technology for research in artificial intelligence. The great power of the Lisp language makes it ideal for other purposes as well, such as writing editing commands.
fr_fr: Lisp (LISt Processing language) a été développé la première fois vers la fin des années 50 au Massachusetts Institute of Technology pour la recherche en intelligence artificielle. La grande puissance du langage Lisp le rend idéal pour d'autres buts aussi bien, comme l'écriture de commandes d'édition.

source: lispref/intro.texi:121 Dozens of Lisp implementations have been built over the years, each with its own idiosyncrasies. Many of them were inspired by Maclisp, which was written in the 1960s at MIT's Project MAC. Eventually the implementors of the descendants of Maclisp came together and developed a standard for Lisp systems, called Common Lisp. In the meantime, Gerry Sussman and Guy Steele at MIT developed a simplified but very powerful dialect of Lisp, called Scheme.
fr_fr: Des douzaines de réalisations de Lisp ont été établies au cours des années, chacune avec ses propres particularités. Bon nombre d'entre elles ont été inspirées par Maclisp, qui a été écrit dans les années 60 au MIT's Project MAC. Par la suite les programmeurs des descendants de Maclisp se sont réunis et ont développé une norme pour des systèmes Lisp, appelée Common Lisp. En attendant, Gerry Sussman et Guy Steele au MIT ont développé un dialecte simplifié mais très puissant de Lisp, appelé Scheme.

source: lispref/intro.texi:130 GNU Emacs Lisp is largely inspired by Maclisp, and a little by Common Lisp. If you know Common Lisp, you will notice many similarities. However, many features of Common Lisp have been omitted or simplified in order to reduce the memory requirements of GNU Emacs. Sometimes the simplifications are so drastic that a Common Lisp user might be very confused. We will occasionally point out how GNU Emacs Lisp differs from Common Lisp. If you don't know Common Lisp, don't worry about it; this manual is self-contained.
fr_fr: GNU Emacs Lisp est en grande partie inspiré par Maclisp, et par Common Lisp. Si vous connaissez le Common Lisp, vous noterez beaucoup de similitudes. Cependant, beaucoup de dispositifs de Common Lisp ont été omis ou simplifié afin de réduire les conditions de mémoire de GNU Emacs. Parfois les simplifications sont si importantes qu'un utilisateur Lisp Common pourrait être très dérouté. Nous préciserons de temps en temps comment le GNU Emacs Lisp diffère du Common Lisp. Si vous ne connaissez pas le Common Lisp, ne vous inquiétez à son sujet; ce manuel est indépendant.

source: lispref/intro.texi:134 A certain amount of Common Lisp emulation is available via the @file{cl} library. @inforef{Top, Overview, cl}.
fr_fr: Une certaine quantité de programmes Lisp Common est disponible par l'intermédiaire de la @file{cl} bibliothèque. @inforef{Top, Overview, cl}.

source: lispref/intro.texi:138 Emacs Lisp is not at all influenced by Scheme; but the GNU project has an implementation of Scheme, called Guile. We use Guile in all new GNU software that calls for extensibility.
fr_fr: Emacs Lisp n'est pas du tout influencé par Scheme; mais le projet GNU a une implémentation, appelée Guile. Nous employons Guile dans tout nouveau logiciel de GNU qui réclame l'extensibilité.

source: lispref/intro.texi:144 This section explains the notational conventions that are used in this manual. You may want to skip this section and refer back to it later.
fr_fr: Cette section explique les conventions d'écriture qui sont employées dans ce manuel. Vous pouvez sauter cette section et vous y référer plus tard.

source: lispref/intro.texi:165 Throughout this manual, the phrases ``the Lisp reader'' and ``the Lisp printer'' refer to those routines in Lisp that convert textual representations of Lisp objects into actual Lisp objects, and vice versa. @xref{Printed Representation}, for more details. You, the person reading this manual, are thought of as ``the programmer'' and are addressed as ``you.'' ``The user'' is the person who uses Lisp programs, including those you write.
fr_fr: Dans tout ce manuel, les expressions ``le lecteur de Lisp'' et ``l'afficheur de Lisp'' se rapportent à ces routines en Lisp qui convertissent les représentations textuelles du Lisp object en objets réels de Lisp, et vice-versa. @xref{Printed Representation}, pour plus de détails. Vous, la personne lisant ce manuel, êtes considérée comme ``programmeur'' et êtes nommée en tant que ``vous''. ``L'utilisateur'' est la personne qui emploie le Lisp des programmes, y compris ceux que vous écrivez.

source: lispref/intro.texi:170 Examples of Lisp code are formatted like this: @code{(list 1 2 3)}. Names that represent metasyntactic variables, or arguments to a function being described, are formatted like this: @var{first-number}.
fr_fr: Des exemples du code de Lisp sont composés comme ceci : @code{(list 1 2 3)}. Des noms qui représentent des variables, ou des arguments à une fonction décrite, sont composés comme ceci : @var{first-number}.

source: lispref/intro.texi:182 In Lisp, the symbol @code{nil} has three separate meanings: it is a symbol with the name @samp{nil}; it is the logical truth value @var{false}; and it is the empty list---the list of zero elements. When used as a variable, @code{nil} always has the value @code{nil}.
fr_fr: En Lisp, le symbole @code{nil} a trois significations distinctes: il est un symbole nommé @samp{nil} ; c'est la vraie valeur logique @var{false} ; et c'est la liste vide---la liste de zéro élément. Une fois utilisé comme variable, @code{nil} a toujours la valeur @code{nil}.

source: lispref/intro.texi:189 As far as the Lisp reader is concerned, @samp{()} and @samp{nil} are identical: they stand for the same object, the symbol @code{nil}. The different ways of writing the symbol are intended entirely for human readers. After the Lisp reader has read either @samp{()} or @samp{nil}, there is no way to determine which representation was actually written by the programmer.
fr_fr: En ce qui concerne le lecteur Lisp, @samp{()} et @samp{nil} sont identiques : ils représentent le même objet, le symbole @code{nil}. Les différentes manières d'écrire le symbole sont prévues entièrement pour les lecteurs humains. Après que le lecteur Lisp ait lu l'un ou l'autre, @samp{()} ou @samp{nil}, il n'y a aucune manière de déterminer quelle représentation a été écrite réellement par le programmeur.

source: lispref/intro.texi:194 In this manual, we write @code{()} when we wish to emphasize that it means the empty list, and we write @code{nil} when we wish to emphasize that it means the truth value @var{false}. That is a good convention to use in Lisp programs also.
fr_fr: Dans ce manuel, nous écrivons @code{()} quand nous souhaitons souligner qu'il signifie la liste vide, et nous écrivons @code{nil} quand nous souhaitons souligner qu'il signifie la vraie valeur @var{false}. C'est une bonne convention à employer dans des programmes de Lisp également.

source: lispref/intro.texi:208 In contexts where a truth value is expected, any non-@code{nil} value is considered to be @var{true}. However, @code{t} is the preferred way to represent the truth value @var{true}. When you need to choose a value which represents @var{true}, and there is no other basis for choosing, use @code{t}. The symbol @code{t} always has the value @code{t}.
fr_fr: Dans les contextes où une vraie valeur est prévue, n'importe quelle valeur non-@code{nil} est considérée comme @var{true}. Cependant, @code{t} est la manière préférée de représenter la vraie valeur @var{true}. Quand vous devez choisir une valeur qui représente @var{true}, et que vous n'avez aucun autre choix, employer @code{t}. Le symbole @code{t} a toujours la valeur @code{t}.

source: lispref/intro.texi:214 In Emacs Lisp, @code{nil} and @code{t} are special symbols that always evaluate to themselves. This is so that you do not need to quote them to use them as constants in a program. An attempt to change their values results in a @code{setting-constant} error. @xref{Constant Variables}.
fr_fr: En Emacs Lisp, @code{nil} et @code{t} sont des symboles spéciaux qui s'évaluent toujours eux-mêmes. De sorte que vous n'avez pas besoin de les citer pour les employer comme constantes dans un programme. Une tentative de changer leurs valeurs a comme conséquence une erreur @code{setting-constant}. @xref{Constant Variables}.

source: lispref/intro.texi:218 Return non-nil iff @var{object} is one of the two canonical boolean values: @code{t} or @code{nil}.
fr_fr: Retourne non-nil si @var{objet} est une des deux valeurs booléennes canoniques : @code{t} ou @code{nil}.

source: lispref/intro.texi:229 A Lisp expression that you can evaluate is called a @dfn{form}. Evaluating a form always produces a result, which is a Lisp object. In the examples in this manual, this is indicated with @samp{@result{}}:
fr_fr: Une expression de Lisp que vous pouvez évaluer s'appelle une @dfn{form}. L'évaluation d'un formulaire produit toujours un résultat, qui est un objet de Lisp. Dans les exemples en ce manuel, ceci est indiqué avec @samp{@result{}} :

source: lispref/intro.texi:242 When a form is a macro call, it expands into a new form for Lisp to evaluate. We show the result of the expansion with @samp{@expansion{}}. We may or may not show the result of the evaluation of the expanded form.
fr_fr: Quand un formulaire est appellé par une macro, il augmente d'un nouveau formulaire pour que le Lisp l'évalue. Nous montrons le résultat de l'expansion avec @samp{@expansion{}}. Nous pouvons ou non montrer le résultat de l'évaluation du formulaire augmenté.

source: lispref/intro.texi:252 Sometimes to help describe one form we show another form that produces identical results. The exact equivalence of two forms is indicated with @samp{@equiv{}}.
fr_fr: Parfois pour aider à décrire un formulaire, nous montrons un autre formulaire qui produit des résultats identiques. L'équivalence exacte de deux formulaires est indiquée avec le @samp{@equiv{}}.

source: lispref/intro.texi:267 Many of the examples in this manual print text when they are evaluated. If you execute example code in a Lisp Interaction buffer (such as the buffer @samp{*scratch*}), the printed text is inserted into the buffer. If you execute the example by other means (such as by evaluating the function @code{eval-region}), the printed text is displayed in the echo area.
fr_fr: Plusieurs des exemples de ce manuel affichent du texte quand ils sont évalués. Si vous exécutez le code d'exemple dans un tampon d'interaction de Lisp (tel que le tampon @samp{*scratch*}), le texte affiché est inséré dans le tampon. Si vous exécutez l'exemple par d'autres moyens (comme pour évaluer la fonction @code{eval-région}), le texte affiché est montré dans le secteur d'écho.

source: lispref/intro.texi:272 Examples in this manual indicate printed text with @samp{@print{}}, irrespective of where that text goes. The value returned by evaluating the form (here @code{bar}) follows on a separate line with @samp{@result{}}.
fr_fr: Les exemples de ce manuel indiquent le texte affiché avec @samp{@print{}}, indépendamment de la destination du texte. La valeur retournée par l'évaluation du formulaire (ici @code{bar}) suit sur une ligne séparée avec @samp{@result{}}.

source: lispref/intro.texi:290 Some examples signal errors. This normally displays an error message in the echo area. We show the error message on a line starting with @samp{@error{}}. Note that @samp{@error{}} itself does not appear in the echo area.
fr_fr: Quelques exemples de signal d'erreurs. Ceci montre normalement un message d'erreur dans le secteur d'écho. Nous montrons le message d'erreur sur une ligne commençant par @samp{@error{}}. Noter que @samp{@error{}} lui-même n'apparaît pas dans le secteur d'écho.

source: lispref/intro.texi:307 Some examples describe modifications to the contents of a buffer, by showing the ``before'' and ``after'' versions of the text. These examples show the contents of the buffer in question between two lines of dashes containing the buffer name. In addition, @samp{@point{}} indicates the location of point. (The symbol for point, of course, is not part of the text in the buffer; it indicates the place @emph{between} two characters where point is currently located.)
fr_fr: Quelques exemples décrivent des modifications du contenu d'un tampon, en montrant ``l'avant'' et ``l'après'' des versions du texte. Ces exemples montrent le contenu du tampon en question entre deux lignes de tirets contenant le nom du tampon. En outre, le @samp{@point{}} indique l'endroit du point. (Le symbole pour le point, naturellement, n'est pas une partie du texte dans le tampon ; il indique l'endroit @emph{entre} deux caractères où le point est actuellement localisé.)

source: lispref/intro.texi:32 This manual attempts to be a full description of Emacs Lisp. For a beginner's introduction to Emacs Lisp, see @cite{An Introduction to Emacs Lisp Programming}, by Bob Chassell, also published by the Free Software Foundation. This manual presumes considerable familiarity with the use of Emacs for editing; see @cite{The GNU Emacs Manual} for this basic information.
fr_fr: Ce manuel essaye d'être une description complète d'Emacs Lisp. Pour la présentation à un débutant d'Emacs Lisp, voir @cite{An Introduction to Emacs Lisp Programming}, par Bob Chassell, également édité par la Free Software Foundation. Ce manuel suppose la connaissance parfaite de l'utilisation d'Emacs pour l'édition ; voir @cite{The GNU Emacs Manual} pour cette information de base.

source: lispref/intro.texi:328 Functions, variables, macros, commands, user options, and special forms are described in this manual in a uniform format. The first line of a description contains the name of the item followed by its arguments, if any.
fr_fr: Des fonctions, les variables, les macros, les commandes, les options d'utilisateur, et les formulaires spéciaux sont décrits dans ce manuel dans un format uniforme. La première ligne de la description contient le nom de l'article suivi de ses arguments, s'il y a.

source: lispref/intro.texi:331 The category---function, variable, or whatever---appears at the beginning of the line.
fr_fr: La catégorie---fonction, variable, ou quoi que soit---est imprimé à côté de la marge.

source: lispref/intro.texi:335 The category---function, variable, or whatever---is printed next to the right margin.
fr_fr: La catégorie---fonction, variable, ou quoi que soit---est imprimé à côté de la marge.

source: lispref/intro.texi:357 In a function description, the name of the function being described appears first. It is followed on the same line by a list of argument names. These names are also used in the body of the description, to stand for the values of the arguments.
fr_fr: Dans une description de fonction, le nom de la fonction étant décrite apparaît d'abord. Il est suivi sur la même ligne d'une liste de noms d'argument. Ces noms sont également employés dans le corps de la description, pour représenter les valeurs des arguments.

source: lispref/intro.texi:362 The appearance of the keyword @code{&optional} in the argument list indicates that the subsequent arguments may be omitted (omitted arguments default to @code{nil}). Do not write @code{&optional} when you call the function.
fr_fr: L'apparition du mot-clé @code{&optional} dans la liste d'argument indique que les arguments suivants peuvent être omis (les arguments omis se transfèrent comme @code{nil}). Ne pas écrire @code{&optional} quand vous appelez la fonction.

source: lispref/intro.texi:368 The keyword @code{&rest} (which must be followed by a single argument name) indicates that any number of arguments can follow. The single argument name following @code{&rest} will receive, as its value, a list of all the remaining arguments passed to the function. Do not write @code{&rest} when you call the function.
fr_fr: Le mot-clé @code{&rest} (qui doit être suivi d'un nom d'argument simple) indique qu'un certain nombre d'arguments va suivre. Le nom d'argument simple suivant @code{&rest} recevra, comme valeur, une liste de tous arguments restants à passer à la fonction. Ne pas écrire @code{&rest} quand vous appelez la fonction.
